configuration/src/InformationRegisters/СвязьОбъектовИРолей/СвязьОбъектовИРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьОбъектовИРолей</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Используется если свойство РассчитыватьПраво не установлено</comment>
    <type>
      <types>EnumRef.ВидыПравДоступа</types>
    </type>
  </resources>
  <resources>
    <name>ИмяМетода</name>
    <comment>Имя метода для расчета значения права</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяМетодаНастройки</name>
    <comment>Имя метода для применения разрешений</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьПраво</name>
    <comment>Определяет способ расчета права: Истина - право будет расчитано методом из свойства ИмяМетода, Ложь - будет использовано значение по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Идентификатор объекта метаданных</comment>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <comment>Программная роль или роль конфигурации</comment>
    <type>
      <types>CatalogRef.ПрограммныеРоли</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ЗначенияРолейДляГруппДоступа/ЗначенияРолейДляГруппДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияРолейДляГруппДоступа</name>
  <resources>
    <name>ВидПраваДоступа</name>
    <type>
      <types>EnumRef.ВидыПравДоступа</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ПрограммныеРоли</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/НастройкиПравОбъектов/НастройкиПравОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравОбъектов</name>
  <resources>
    <name>ВидПраваДоступа</name>
    <type>
      <types>EnumRef.ВидыПравДоступа</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектОграниченийДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ПрограммныеРоли</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Документ</name>
      <description>Документ</description>
    </items>
    <items>
      <name>Константа</name>
      <description>Константа</description>
    </items>
    <items>
      <name>Обработка</name>
      <description>Обработка</description>
    </items>
    <items>
      <name>ОбщаяКоманда</name>
      <description>ОбщаяКоманда</description>
    </items>
    <items>
      <name>ОбщаяФорма</name>
      <description>ОбщаяФорма</description>
    </items>
    <items>
      <name>Отчет</name>
      <description>Отчет</description>
    </items>
    <items>
      <name>Перечисление</name>
      <description>Перечисление</description>
    </items>
    <items>
      <name>ПланВидовХарактеристик</name>
      <description>ПланВидовХарактеристик</description>
    </items>
    <items>
      <name>ПланОбмена</name>
      <description>ПланОбмена</description>
    </items>
    <items>
      <name>РегистрНакопления</name>
      <description>РегистрНакопления</description>
    </items>
    <items>
      <name>РегистрСведений</name>
      <description>РегистрСведений</description>
    </items>
    <items>
      <name>Справочник</name>
      <description>Справочник</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/CommonModules/БезопасностьВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьБезопасностьОбъекта(Знач МетаданныеФормы, Знач ТипПрава, Знач Объект = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ИдентификаторыПервогоУровня
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Наименование = &Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ИдентификаторыВторогоУровня
	|ИЗ
	|	ИдентификаторыПервогоУровня КАК ИдентификаторыПервогоУровня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ИдентификаторыПервогоУровня.Ссылка = ИдентификаторыОбъектовМетаданных.Родитель
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Наименование = &Название
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ИдентификаторыМетаданныхОбъекта
	|ИЗ
	|	ИдентификаторыВторогоУровня КАК ИдентификаторыВторогоУровня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ИдентификаторыВторогоУровня.Ссылка = ИдентификаторыОбъектовМетаданных.Родитель
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Наименование = &Форма
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИдентификаторыВторогоУровня.Ссылка
	|ИЗ
	|	ИдентификаторыВторогоУровня КАК ИдентификаторыВторогоУровня
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИдентификаторыПервогоУровня.Ссылка
	|ИЗ
	|	ИдентификаторыПервогоУровня КАК ИдентификаторыПервогоУровня
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязьОбъектовИРолей.Роль КАК Право,
	|	ПрограммныеРоли.Родитель КАК ТипПрава,
	|	ВЫБОР
	|		КОГДА НастройкиПравОбъектов.Объект ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ЗначенияРолейДляГруппДоступа.Объект ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА СвязьОбъектовИРолей.РассчитыватьПраво
	|									ТОГДА НЕОПРЕДЕЛЕНО
	|								ИНАЧЕ СвязьОбъектовИРолей.ЗначениеПоУмолчанию
	|							КОНЕЦ
	|					ИНАЧЕ ЗначенияРолейДляГруппДоступа.ВидПраваДоступа
	|				КОНЕЦ
	|		ИНАЧЕ НастройкиПравОбъектов.ВидПраваДоступа
	|	КОНЕЦ КАК ВидПраваДоступа,
	|	СвязьОбъектовИРолей.ИмяМетода КАК ИмяМетода,
	|	СвязьОбъектовИРолей.ИмяМетодаНастройки КАК ИмяМетодаНастройки
	|ИЗ
	|	РегистрСведений.СвязьОбъектовИРолей КАК СвязьОбъектовИРолей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыМетаданныхОбъекта КАК ИдентификаторыМетаданныхОбъекта
	|		ПО СвязьОбъектовИРолей.Объект = ИдентификаторыМетаданныхОбъекта.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрограммныеРоли КАК ПрограммныеРоли
	|		ПО СвязьОбъектовИРолей.Роль = ПрограммныеРоли.Ссылка
	|			И (ПрограммныеРоли.Родитель = &ТипПрава)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияРолейДляГруппДоступа КАК ЗначенияРолейДляГруппДоступа
	|		ПО (ЗначенияРолейДляГруппДоступа.ГруппаДоступа В (&ГруппыДоступа))
	|			И СвязьОбъектовИРолей.Объект = ЗначенияРолейДляГруппДоступа.Объект
	|			И СвязьОбъектовИРолей.Роль = ЗначенияРолейДляГруппДоступа.Роль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравОбъектов КАК НастройкиПравОбъектов
	|		ПО (НастройкиПравОбъектов.Объект = &ОбъектСсылка)
	|			И (НастройкиПравОбъектов.Пользователь = &Пользователь)
	|			И СвязьОбъектовИРолей.Роль = НастройкиПравОбъектов.Роль";
	
	Запрос.УстановитьПараметр("Тип", МетаданныеФормы.Тип);
	Запрос.УстановитьПараметр("Название", МетаданныеФормы.Название);
	Запрос.УстановитьПараметр("Форма", МетаданныеФормы.Форма);
	Запрос.УстановитьПараметр("ГруппыДоступа", БезопасностьПовтИсп.ПолучитьГруппыДоступаПользователя());
	Запрос.УстановитьПараметр("ОбъектСсылка", Объект);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТипПрава", ТипПрава);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
